import pandas as pd

# Початковий словник з даними про учнів
students = {}

# Функція для додавання інформації про учнів у словник
def add_student(students, student_id, прізвище, ім_я, по_батькові, рік, місяць, число):
    students[student_id] = {
        "прізвище": прізвище,
        "ім_я": ім_я,
        "по батькові": по_батькові,
        "дата_народження": (рік, місяць, число)
    }

# Додаємо інформацію про учнів за допомогою функції
add_student(students, 1, "Іванов", "Іван", "Петрович", 2006, 5, 15)
add_student(students, 2, "Петров", "Петро", "Іванович", 2007, 10, 26)
add_student(students, 3, "Сидоров", "Сидір", "Миколайович", 2005, 7, 9)
add_student(students, 4, "Петренко", "Петро", "Васильович", 2004, 3, 12)
add_student(students, 5, "Марченко", "Марія", "Андріївна", 2006, 2, 18)
add_student(students, 6, "Савченко", "Олег", "Олександрович", 2005, 10, 26)
add_student(students, 7, "Ковальчук", "Анна", "Сергіївна", 2007, 8, 31)
add_student(students, 8, "Гриценко", "Григорій", "Петрович", 2004, 10, 17)
add_student(students, 9, "Лисенко", "Лідія", "Олександрівна", 2007, 6, 23)
add_student(students, 10, "Коваль", "Вадим", "Ігоревич", 2005, 10, 26)

# Створюємо DataFrame зі словника
df = pd.DataFrame.from_dict(students, orient='index')

# Виводимо DataFrame на екран
print("Початковий DataFrame:")
print(df)

# Групуємо дані за рік народження та обчислюємо кількість учнів у кожній групі
grouped_data = df.groupby('дата_народження').size()

# Виводимо результат групування
print("\nГрупування за рік народження та кількість учнів у кожній групі:")
print(grouped_data)
