text = ("Україна — це країна з багатою історією, мальовничими пейзажами та гостинними людьми. Розташована в центрі "
        "Східної Європи, вона має найбільшу площу серед європейських країн. Україна славиться своєю культурною "
        "спадщиною, мовною різноманітністю та багатим фольклором. Країна також відома своєю смачною кухнею, "
        "де домінують борщ, вареники та сало. Незважаючи на випробування та складнощі, Україна завжди боролася за "
        "свою незалежність і сьогодні є суверенною державою. Її міста, такі як Київ, Львів і Одеса, пропонують "
        "різноманітність архітектурних шедеврів та культурних подій. Україна вражає своєю красою і глибокими "
        "коріннями, які роблять її особливою серед інших країн світу.")

text = text.upper()  # Переводить кожну букву тексту в верхній реєстр
print(text)
text = text.replace("У", "В")  # Замінює кожну букву "У" на "В" в тексті
print(text)
text = text.lower()  # Переводить кожну букву тексту в нижній
print(text)

text = text.capitalize() # Переводить першу букву у вехній регістр
print(text)
text = text.swapcase() # Замінює велику літеру на маленьку і навпаки
print(text)
text = text.replace("Ц", "А") # Замінює кожну букву "Ц" на "А" в тексті
print(text)

# новий код
sentences = text.split(". ")   # роздіяє рядок на список із речень. ". " - роздільник
count_sent = 0
count_word = 0
for sentence in sentences:
    words = sentence.split()   # роздіяє рядок на список із слів. " " - роздільник за замовченням
    for word in words:
        if word.startswith("В") and word.endswith("А"):   # перевіряє, чи слово починається на "В" та закінчується "а"
            count_word += 1
    count_sent += 1
print(f"\nКількість речень в тексті: {count_sent}")
print(f"Кількість слів, які починаються на 'У' та закінчуються на 'А' дорівнює: {count_word}")